[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:73:19
     
     const testid = "CommonsForm";
     const curr = new Date();
-    const today = curr.toISOString().split('T')[0].substring(0,8) + curr.toString().split(' ')[2];;
+    const today = curr.toISOString().split('T')[0].substring(0, 8) - curr.toString().split(' ')[2];;
     const currMonth = curr.getMonth() % 12;
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-05-17)

Expected the element to have value:
  2024-05-17
Received:

[Killed] MethodExpression
main/components/Commons/CommonsForm.js:73:19
     
     const testid = "CommonsForm";
     const curr = new Date();
-    const today = curr.toISOString().split('T')[0].substring(0,8) + curr.toString().split(' ')[2];;
+    const today = curr.toISOString().split('T')[0] + curr.toString().split(' ')[2];;
     const currMonth = curr.getMonth() % 12;
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-05-17)

Expected the element to have value:
  2024-05-17
Received:

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:74:23
     const testid = "CommonsForm";
     const curr = new Date();
     const today = curr.toISOString().split('T')[0].substring(0,8) + curr.toString().split(' ')[2];;
-    const currMonth = curr.getMonth() % 12;
+    const currMonth = curr.getMonth() * 12;
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-06-17)

Expected the element to have value:
  2024-06-17
Received:
  2028-02-17
