[Killed] ConditionalExpression
src/main/pages/PlayPage.js:167:22
                 <Container>
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:167:23
                 <Container>
-                    {!!commonsPlus && (
+                    {!commonsPlus && (
                         <CommonsOverview
                             commonsPlus={commonsPlus}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')
