[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:74:25
     
     const testid = "CommonsForm";
     const {today, currMonth, nextMonth} = getTodayCurrMonthNextMonth();
-    const DefaultVals = {
-        name: "",
-        startingBalance: defaultValuesData?.startingBalance || "10000",
-        cowPrice: defaultValuesData?.cowPrice || "100",
-        milkPrice: defaultValuesData?.milkPrice || "1",
-        degradationRate: defaultValuesData?.degradationRate || 0.001,
-        carryingCapacity: defaultValuesData?.carryingCapacity || 100,
-        startingDate: today,
-        lastDate: nextMonth,
-      };
+    const DefaultVals = {};
 
     const belowStrategy = defaultValuesData?.belowCapacityStrategy;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(0.001)

Expected the element to have value:
  0.001
Received:
  null
