[Killed] BlockStatement
src/main/utils/dateUtils.js:21:42
 const dayInSeconds = 24 * hourInSeconds;
 const weekInSeconds = 7 * dayInSeconds;
 
-const getTodayCurrMonthNextMonth = () => {
-    const curr = new Date(Date.now()-(new Date()).getTimezoneOffset()*60000);
-    const today = curr.toISOString().split('T')[0];
-    const currMonth = curr.getMonth() % 12;
-    const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
-    return { today, currMonth, nextMonth };
-}
+const getTodayCurrMonthNextMonth = () => {}
 
 export function formatTime(timeString) {
killedBy: dateUtils tests getTodayCurrMonthNextMonth tests calculates days properly
statusReason: TypeError: Cannot destructure property 'today' of '(0 , _dateUtils.getTodayCurrMonthNextMonth)(...)' as it is undefined.

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:22:27
 const weekInSeconds = 7 * dayInSeconds;
 
 const getTodayCurrMonthNextMonth = () => {
-    const curr = new Date(Date.now()-(new Date()).getTimezoneOffset()*60000);
+    const curr = new Date(Date.now() + new Date().getTimezoneOffset() * 60000);
     const today = curr.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
killedBy: dateUtils tests getTodayCurrMonthNextMonth tests calculates days properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-06-01"
Received: "2022-06-02"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:22:38
 const weekInSeconds = 7 * dayInSeconds;
 
 const getTodayCurrMonthNextMonth = () => {
-    const curr = new Date(Date.now()-(new Date()).getTimezoneOffset()*60000);
+    const curr = new Date(Date.now()-new Date().getTimezoneOffset() / 60000);
     const today = curr.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
killedBy: dateUtils tests getTodayCurrMonthNextMonth tests calculates days properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-06-01"
Received: "2022-06-02"
