[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:9:44
 import {getTodayNextMonth} from "main/utils/dateUtils";
 
 function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
-    let modifiedCommons = initialCommons ? { ...initialCommons } : {};  // make a shallow copy of initialCommons
+    let modifiedCommons = initialCommons ? {} : {};  // make a shallow copy of initialCommons
 
     if (modifiedCommons.startingDate) {
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: Error: expect(element).toHaveValue(Seths Common)

Expected the element to have value:
  Seths Common
Received:

[Killed] BlockStatement
main/components/Commons/CommonsForm.js:11:39
 function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
     let modifiedCommons = initialCommons ? { ...initialCommons } : {};  // make a shallow copy of initialCommons
 
-    if (modifiedCommons.startingDate) {
-        modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
-    }
+    if (modifiedCommons.startingDate) {}
 
     // Stryker disable all
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2022-03-05)

Expected the element to have value:
  2022-03-05
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:74:25
     
     const testid = "CommonsForm";
     const {today, nextMonth} = getTodayNextMonth();
-    const DefaultVals = {
-        name: "",
-        startingBalance: defaultValuesData?.startingBalance || "10000",
-        cowPrice: defaultValuesData?.cowPrice || "100",
-        milkPrice: defaultValuesData?.milkPrice || "1",
-        degradationRate: defaultValuesData?.degradationRate || 0.001,
-        carryingCapacity: defaultValuesData?.carryingCapacity || 100,
-        startingDate: today,
-        lastDate: nextMonth,
-      };
+    const DefaultVals = {};
 
     const belowStrategy = defaultValuesData?.belowCapacityStrategy;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(0.001)

Expected the element to have value:
  0.001
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:76:26
     const {today, nextMonth} = getTodayNextMonth();
     const DefaultVals = {
         name: "",
-        startingBalance: defaultValuesData?.startingBalance || "10000",
+        startingBalance: false,
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(10000)

Expected the element to have value:
  10000
Received:
  null

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:76:26
     const {today, nextMonth} = getTodayNextMonth();
     const DefaultVals = {
         name: "",
-        startingBalance: defaultValuesData?.startingBalance || "10000",
+        startingBalance: defaultValuesData?.startingBalance && "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(10000)

Expected the element to have value:
  10000
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:78:20
         name: "",
         startingBalance: defaultValuesData?.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
-        milkPrice: defaultValuesData?.milkPrice || "1",
+        milkPrice: defaultValuesData.milkPrice || "1",
         degradationRate: defaultValuesData?.degradationRate || 0.001,
         carryingCapacity: defaultValuesData?.carryingCapacity || 100,
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'milkPrice')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:79:26
         startingBalance: defaultValuesData?.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
-        degradationRate: defaultValuesData?.degradationRate || 0.001,
+        degradationRate: true,
         carryingCapacity: defaultValuesData?.carryingCapacity || 100,
         startingDate: today,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(0.001)

Expected the element to have value:
  0.001
Received:
  null

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:106:93
 
             <div className="border-bottom mb-3"></div>
 
-            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r0`}>
+            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={``}>
                 <Col className="" md={6}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r0"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:116:46
                             delay='5'
                         >
                             <Form.Control
-                                data-testid={`${testid}-name`}
+                                data-testid={``}
                                 id="name"
                                 type="text"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element by: [data-testid="CommonsForm-name"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:121:65
                                 type="text"
                                 defaultValue={DefaultVals.name}
                                 isInvalid={!!errors.name}
-                                {...register("name", {required: "Commons name is required"})}
+                                {...register("name", {required: ""})}
                             />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element with the text: Commons name is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:139:46
                         >
                             <Form.Control
                                 id="startingBalance"
-                                data-testid={`${testid}-startingBalance`}
+                                data-testid={``}
                                 type="number"
                                 step="0.01"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-startingBalance"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:146:47
                                 isInvalid={!!errors.startingBalance}
                                 {...register("startingBalance", {
                                     valueAsNumber: true,
-                                    required: "Starting Balance is required",
+                                    required: "",
                                     min: {value: 0.0, message: "Starting Balance must be ≥ 0.00"},
                                 })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Starting Balance is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:158:93
                 </Col>
             </Row>
 
-            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r1`}>
+            <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={``}>
                 <Col md={6}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r1"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:177:65
                                 {...register("cowPrice", {
                                     valueAsNumber: true,
                                     required: "Cow price is required",
-                                    min: {value: 0.01, message: "Cow price must be ≥ 0.01"},
+                                    min: {value: 0.01, message: ""},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Cow price must be ≥ 0.01/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:207:42
                                 {...register("milkPrice", {
                                     valueAsNumber: true,
                                     required: "Milk price is required",
-                                    min: {value: 0.01, message: "Milk price must be ≥ 0.01"},
+                                    min: {},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:220:77
             </Row>
 
 
-            <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r2`}>
+            <Row className="mt-1 flex justify-content-start" style={{width: ""}} data-testid={`${testid}-r2`}>
                 <Col md={4}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 80%;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:258:42
                             delay = '100'
                         >
                         <Form.Control
-                            data-testid={`${testid}-carryingCapacity`}
+                            data-testid={``}
                             id="carryingCapacity"
                             type="number"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-carryingCapacity"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:266:43
                             isInvalid={!!errors.carryingCapacity}
                             {...register("carryingCapacity", {
                                 valueAsNumber: true,
-                                required: "Carrying capacity is required",
+                                required: "",
                                 min: {value: 1, message: "Carrying Capacity must be ≥ 1"},
                             })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Carrying capacity is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:267:38
                             {...register("carryingCapacity", {
                                 valueAsNumber: true,
                                 required: "Carrying capacity is required",
-                                min: {value: 1, message: "Carrying Capacity must be ≥ 1"},
+                                min: {},
                             })}
                         />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Carrying Capacity must be ≥ 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:292:42
                             step="1"
                             defaultValue={defaultValuesData?.capacityPerUser}
                             isInvalid={!!errors.capacityPerUser}
-                            {...register("capacityPerUser", {
+                            {...register("", {
                                 valueAsNumber: true,
                                 required: "Capacity Per User is required",
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:307:78
             </Row>
 
             <Row>
-                <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+                <Form.Group className="mb-5" style={{width: '300px', height: ""}} data-testid={`${testid}-r3`}>
                     <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                     <Form.Control
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- height: 50px;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:310:38
                 <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
                     <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                     <Form.Control
-                        data-testid={`${testid}-startingDate`}
+                        data-testid={``}
                         id="startingDate"
                         type="date"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-startingDate"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:333:38
                         type="date"
                         defaultValue={DefaultVals.lastDate}
                         isInvalid={!!errors.lastDate}
-                        {...register("lastDate", {
+                        {...register("", {
                             valueAsDate: true,
                             validate: {isPresent: (v) => !isNaN(v)},
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:379:42
                                     delay = '100'
                                 >
                         <Form.Check
-                            data-testid={`${testid}-showLeaderboard`}
+                            data-testid={``}
                             type="checkbox"
                             id="showLeaderboard"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-showLeaderboard"]

<body>
  <div>
    <form
      class=""
    >
      <div
