[Killed] EqualityOperator
src/main/utils/dateUtils.js:2:37
 
-const padWithZero = (n) => { return n < 10 ? '0' + n : n; }
+const padWithZero = (n) => { return n >= 10 ? '0' + n : n; }
 
 const timestampToDate = (timestamp) => {
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2023-05-16
Received:
  2023-5-016

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:2:37
 
-const padWithZero = (n) => { return n < 10 ? '0' + n : n; }
+const padWithZero = (n) => { return false ? '0' + n : n; }
 
 const timestampToDate = (timestamp) => {
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2023-05-16
Received:
  2023-5-16

[Killed] BlockStatement
src/main/utils/dateUtils.js:4:40
 
 const padWithZero = (n) => { return n < 10 ? '0' + n : n; }
 
-const timestampToDate = (timestamp) => {
-    var date = new Date(timestamp);
-    return (date.getFullYear() + "-" + (padWithZero(date.getMonth()+1)) + "-" + padWithZero(date.getDate()));
-}
+const timestampToDate = (timestamp) => {}
 
 const daysSinceTimestamp = (date) => {
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:6:53
 
 const timestampToDate = (timestamp) => {
     var date = new Date(timestamp);
-    return (date.getFullYear() + "-" + (padWithZero(date.getMonth()+1)) + "-" + padWithZero(date.getDate()));
+    return (date.getFullYear() + "-" + (padWithZero(date.getMonth() - 1)) + "-" + padWithZero(date.getDate()));
 }
 
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2023-05-16
Received:
  2023-03-16

[Killed] BlockStatement
src/main/utils/dateUtils.js:9:38
     return (date.getFullYear() + "-" + (padWithZero(date.getMonth()+1)) + "-" + padWithZero(date.getDate()));
 }
 
-const daysSinceTimestamp = (date) => {
-    var today = new Date();
-    var startingDate = new Date(date);
-    var timeDiff = Math.abs(today.getTime() - startingDate.getTime());
-    return Math.ceil(timeDiff / (1000 * 3600 * 24));
-}
+const daysSinceTimestamp = (date) => {}
 
 const minutesInSeconds = 60;
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: undefined

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:12:29
 const daysSinceTimestamp = (date) => {
     var today = new Date();
     var startingDate = new Date(date);
-    var timeDiff = Math.abs(today.getTime() - startingDate.getTime());
+    var timeDiff = Math.abs(today.getTime() + startingDate.getTime());
     return Math.ceil(timeDiff / (1000 * 3600 * 24));
 }
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 38280

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:13:34
     var today = new Date();
     var startingDate = new Date(date);
     var timeDiff = Math.abs(today.getTime() - startingDate.getTime());
-    return Math.ceil(timeDiff / (1000 * 3600 * 24));
+    return Math.ceil(timeDiff / (1000 * 3600 / 24));
 }
 
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 4636

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:13:34
     var today = new Date();
     var startingDate = new Date(date);
     var timeDiff = Math.abs(today.getTime() - startingDate.getTime());
-    return Math.ceil(timeDiff / (1000 * 3600 * 24));
+    return Math.ceil(timeDiff / (1000 / 3600 * 24));
 }
 
killedBy: dateUtils tests daysSinceTimestamp tests calculates days properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 104302378

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:17:23
 }
 
 const minutesInSeconds = 60;
-const hourInSeconds = 60 * minutesInSeconds;
+const hourInSeconds = 60 / minutesInSeconds;
 const dayInSeconds = 24 * hourInSeconds;
 const weekInSeconds = 7 * dayInSeconds;
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "0 day ago"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:18:22
 
 const minutesInSeconds = 60;
 const hourInSeconds = 60 * minutesInSeconds;
-const dayInSeconds = 24 * hourInSeconds;
+const dayInSeconds = 24 / hourInSeconds;
 const weekInSeconds = 7 * dayInSeconds;
 
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "5/31/2022"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:19:23
 const minutesInSeconds = 60;
 const hourInSeconds = 60 * minutesInSeconds;
 const dayInSeconds = 24 * hourInSeconds;
-const weekInSeconds = 7 * dayInSeconds;
+const weekInSeconds = 7 / dayInSeconds;
 
 const getTodayNextMonth = () => {
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "5/29/2022"

[Killed] BlockStatement
src/main/utils/dateUtils.js:21:33
 const dayInSeconds = 24 * hourInSeconds;
 const weekInSeconds = 7 * dayInSeconds;
 
-const getTodayNextMonth = () => {
-    const curr = new Date(Date.now()-(new Date()).getTimezoneOffset()*60000);
-    const today = curr.toISOString().split('T')[0];
-    const currMonth = curr.getMonth() % 12;
-    const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
-    return { today, nextMonth };
-}
+const getTodayNextMonth = () => {}
 
 export function formatTime(timeString) {
killedBy: dateUtils tests getTodayNextMonth tests calculates date and next month properly
statusReason: TypeError: Cannot destructure property 'today' of '(0 , _dateUtils.getTodayNextMonth)(...)' as it is undefined.

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:22:27
 const weekInSeconds = 7 * dayInSeconds;
 
 const getTodayNextMonth = () => {
-    const curr = new Date(Date.now()-(new Date()).getTimezoneOffset()*60000);
+    const curr = new Date(Date.now() + new Date().getTimezoneOffset() * 60000);
     const today = curr.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
killedBy: dateUtils tests getTodayNextMonth tests calculates date and next month properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-06-01"
Received: "2022-06-02"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:22:38
 const weekInSeconds = 7 * dayInSeconds;
 
 const getTodayNextMonth = () => {
-    const curr = new Date(Date.now()-(new Date()).getTimezoneOffset()*60000);
+    const curr = new Date(Date.now()-new Date().getTimezoneOffset() / 60000);
     const today = curr.toISOString().split('T')[0];
     const currMonth = curr.getMonth() % 12;
killedBy: dateUtils tests getTodayNextMonth tests calculates date and next month properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-06-01"
Received: "2022-06-02"

[Killed] StringLiteral
src/main/utils/dateUtils.js:23:44
 
 const getTodayNextMonth = () => {
     const curr = new Date(Date.now()-(new Date()).getTimezoneOffset()*60000);
-    const today = curr.toISOString().split('T')[0];
+    const today = curr.toISOString().split("")[0];
     const currMonth = curr.getMonth() % 12;
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
killedBy: dateUtils tests getTodayNextMonth tests calculates date and next month properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2022-06-01"
Received: "2"

[Killed] BooleanLiteral
src/main/utils/dateUtils.js:30:9
 }
 
 export function formatTime(timeString) {
-    if (!timeString) {
+    if (timeString) {
         return "";
     }
killedBy: dateUtils tests formatTime tests should return empty string for null input
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "12/31/1969"

[Killed] BlockStatement
src/main/utils/dateUtils.js:30:22
 }
 
 export function formatTime(timeString) {
-    if (!timeString) {
-        return "";
-    }
+    if (!timeString) {}
 
     const now = new Date();
killedBy: dateUtils tests formatTime tests should return empty string for null input
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "12/31/1969"

[Killed] StringLiteral
src/main/utils/dateUtils.js:31:16
 
 export function formatTime(timeString) {
     if (!timeString) {
-        return "";
+        return "Stryker was here!";
     }
 
killedBy: dateUtils tests formatTime tests should return empty string for null input
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "Stryker was here!"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:36:36
 
     const now = new Date();
     const dateFromEpoch = new Date(timeString);
-    const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
+    const secondsPast = Math.floor((now - dateFromEpoch) * 1000);
 
     if (secondsPast < minutesInSeconds * 2) {
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "5/31/2022"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:36:37
 
     const now = new Date();
     const dateFromEpoch = new Date(timeString);
-    const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
+    const secondsPast = Math.floor((now + dateFromEpoch) / 1000);
 
     if (secondsPast < minutesInSeconds * 2) {
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "5/31/2022"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:38:9
     const dateFromEpoch = new Date(timeString);
     const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
-    if (secondsPast < minutesInSeconds * 2) {
+    if (true) {
         return 'Online now';
     }
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "Online now"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:38:9
     const dateFromEpoch = new Date(timeString);
     const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
-    if (secondsPast < minutesInSeconds * 2) {
+    if (secondsPast >= minutesInSeconds * 2) {
         return 'Online now';
     }
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "1 minutes ago"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:42:9
         return 'Online now';
     }
 
-    if (secondsPast < hourInSeconds) {
+    if (true) {
         const minutes = Math.floor(secondsPast / 60);
         return `${minutes} minutes ago`;
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "180 minutes ago"

[Killed] BlockStatement
src/main/utils/dateUtils.js:42:38
         return 'Online now';
     }
 
-    if (secondsPast < hourInSeconds) {
-        const minutes = Math.floor(secondsPast / 60);
-        return `${minutes} minutes ago`;
-    }
+    if (secondsPast < hourInSeconds) {}
 
     if (secondsPast < dayInSeconds) {
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "0 hour ago"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:43:36
     }
 
     if (secondsPast < hourInSeconds) {
-        const minutes = Math.floor(secondsPast / 60);
+        const minutes = Math.floor(secondsPast * 60);
         return `${minutes} minutes ago`;
     }
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "7200 minutes ago"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:47:9
         return `${minutes} minutes ago`;
     }
 
-    if (secondsPast < dayInSeconds) {
+    if (false) {
         const hours = Math.floor(secondsPast / 3600);
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "0 day ago"

[Killed] BlockStatement
src/main/utils/dateUtils.js:47:37
         return `${minutes} minutes ago`;
     }
 
-    if (secondsPast < dayInSeconds) {
-        const hours = Math.floor(secondsPast / 3600);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
-    }
+    if (secondsPast < dayInSeconds) {}
     
     if (secondsPast < weekInSeconds) {
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "0 day ago"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:48:34
     }
 
     if (secondsPast < dayInSeconds) {
-        const hours = Math.floor(secondsPast / 3600);
+        const hours = Math.floor(secondsPast * 3600);
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
     }
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "38880000 hours ago"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:49:32
 
     if (secondsPast < dayInSeconds) {
         const hours = Math.floor(secondsPast / 3600);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
+        return `${hours} hour${false ? 's' : ''} ago`;
     }
     
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "3 hour ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:49:32
 
     if (secondsPast < dayInSeconds) {
         const hours = Math.floor(secondsPast / 3600);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
+        return `${hours} hour${hours <= 1 ? 's' : ''} ago`;
     }
     
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3 hours ago"
Received: "3 hour ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:52:9
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
     }
     
-    if (secondsPast < weekInSeconds) {
+    if (secondsPast >= weekInSeconds) {
         const days = Math.floor(secondsPast / 86400);
         return `${days} day${days > 1 ? 's' : ''} ago`;
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "5/29/2022"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:52:9
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
     }
     
-    if (secondsPast < weekInSeconds) {
+    if (false) {
         const days = Math.floor(secondsPast / 86400);
         return `${days} day${days > 1 ? 's' : ''} ago`;
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "5/29/2022"

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:53:33
     }
     
     if (secondsPast < weekInSeconds) {
-        const days = Math.floor(secondsPast / 86400);
+        const days = Math.floor(secondsPast * 86400);
         return `${days} day${days > 1 ? 's' : ''} ago`;
     }
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "14929920000 days ago"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:54:30
     
     if (secondsPast < weekInSeconds) {
         const days = Math.floor(secondsPast / 86400);
-        return `${days} day${days > 1 ? 's' : ''} ago`;
+        return `${days} day${false ? 's' : ''} ago`;
     }
 
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "2 day ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:54:30
     
     if (secondsPast < weekInSeconds) {
         const days = Math.floor(secondsPast / 86400);
-        return `${days} day${days > 1 ? 's' : ''} ago`;
+        return `${days} day${days <= 1 ? 's' : ''} ago`;
     }
 
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "2 day ago"
