[Killed] ObjectLiteral
src/main/pages/AdminListAnnouncementsPage.js:21:28
                 <Button
                     variant="primary"
                     href="/announcements/create"
-                    style={{ float: "right" }}
+                    style={{}}
                 >
                     Create Announcement 
killedBy: AdminListAnnouncementsPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
