[Killed] BlockStatement
src/main/pages/AdminListAnnouncementsPage.js:15:32
 
     let { commonsId } = useParams();
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href={`/admin/announcements/${commonsId}/create`}
-                    style={{ float: "right" }}
-                >
-                    Create Announcement 
-                </Button>
-            )
-        } 
-      }
+    const createButton = () => {}
 
     const { data: announcements, error: _error, status: _status } =
killedBy: AdminListAnnouncementsPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Announcement/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/AdminListAnnouncementsPage.js:21:28
                 <Button
                     variant="primary"
                     href={`/admin/announcements/${commonsId}/create`}
-                    style={{ float: "right" }}
+                    style={{}}
                 >
                     Create Announcement 
killedBy: AdminListAnnouncementsPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
src/main/pages/AdminListAnnouncementsPage.js:33:7
      useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/announcements/all?commonsId=${commonsId}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/announcements/all`,
-        params: {
-            commonsId
-        }
-      },
+      {},
       // Stryker disable next-line all : don't test default value of empty list
       []
killedBy: AdminListAnnouncementsPage tests renders three announcements correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
