[Killed] BlockStatement
main/components/Commons/CommonsTable.js:42:45
         navigate(route)
     }
 
-    const announcementsCallback = (cell) => {
-        const route = `/admin/announcements/${cell.row.values["commons.id"]}`
-        navigate(route)
-    }
+    const announcementsCallback = (cell) => {}
 
     const columns = [
killedBy: UserTable tests Clicking Announcements button navigates to the correct route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/announcements/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:43:23
     }
 
     const announcementsCallback = (cell) => {
-        const route = `/admin/announcements/${cell.row.values["commons.id"]}`
+        const route = ``
         navigate(route)
     }
killedBy: UserTable tests Clicking Announcements button navigates to the correct route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/announcements/1"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:53:9
             accessor: 'commons.id', // accessor is the "key" in the data
 
         },
-        {
-            Header:'Name',
-            accessor: 'commons.name',
-        },
+        {},
         {
             Header: <span>Cow< br /> Price</span>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:57:9
             Header:'Name',
             accessor: 'commons.name',
         },
-        {
-            Header: <span>Cow< br /> Price</span>,
-            accessor: row => row.commons.cowPrice,
-            id: 'commons.cowPrice'
-        },
+        {},
         {
             Header:<span> Milk <br /> Price </span>,
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:67:9
             accessor: row => row.commons.milkPrice,
             id: 'commons.milkPrice' 
         },
-        {
-            Header:<span> Start <br /> Bal </span>,
-            accessor: row => row.commons.startingBalance,
-            id: 'commons.startingBalance'
-        },
+        {},
         {
             Header:<span> Starting <br /> Date </span>,
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:87:9
             accessor: row => row.commons.degradationRate,
             id: 'commons.degradationRate'
         },
-        {
-            Header:<span> Show <br /> LrdrBrd? </span>,
-            id: 'commons.showLeaderboard', // needed for tests
-            accessor: (row, _rowIndex) => String(row.commons.showLeaderboard) // hack needed for boolean values to show up
-        },
+        {},
         {
             Header:<span> Show <br /> Chat? </span>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:101:9
             Header: <span> Tot <br /> Cows </span>,
             accessor: 'totalCows'
         },
-        {
-            Header: <span> Cap / <br /> User </span>,
-            accessor: row => row.commons.capacityPerUser,
-            id: 'commons.capacityPerUser'
-        },
+        {},
         {
             Header: <span> Carry <br /> Cap </span>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:121:22
 
     const columnsIfAdmin = [
         ...columns,
-        ButtonColumn("Edit", "primary", editCallback, testid),
+        ButtonColumn("", "primary", editCallback, testid),
         ButtonColumn("Delete", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
killedBy: AdminListCommonPage tests renders three commons without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:122:22
     const columnsIfAdmin = [
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, testid),
-        ButtonColumn("Delete", "danger", deleteCallback, testid),
+        ButtonColumn("", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
         ButtonColumn("Announcements", "warning", announcementsCallback, testid),
killedBy: UserTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:123:37
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, testid),
         ButtonColumn("Delete", "danger", deleteCallback, testid),
-        ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
+        ButtonColumn("Leaderboard", "", leaderboardCallback, testid),
         ButtonColumn("Announcements", "warning", announcementsCallback, testid),
         HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-secondary")

Expected the element to have class:
  btn-secondary
Received:
  btn

[Killed] ConditionalExpression
main/components/Commons/CommonsTable.js:155:10
             columns={columnsToDisplay}
             testid={testid}
         />
-        {hasRole(currentUser,"ROLE_ADMIN") && commonsModal}
+        {true}
     </>);
 };
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>
