[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.js:6:44
 
 import AnnouncementForm from "main/components/Announcement/AnnouncementForm";
 
-const AdminCreateAnnouncementsPage = () => {
-
-    return (
-        <BasicLayout>
-            <h2>Create Announcement</h2>
-            <AnnouncementForm />
-        </BasicLayout>
-    );
-};
+const AdminCreateAnnouncementsPage = () => {};
 
 export default AdminCreateAnnouncementsPage;
killedBy: AdminCreateAnnouncementsPage tests renders without crashing
statusReason: Error: AdminCreateAnnouncementsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
