[Timeout] BlockStatement
src/main/utils/currentUser.js:37:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  if (currentUser == null) return false;
-
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}

[Timeout] EqualityOperator
src/main/utils/currentUser.js:38:7
 }
 
 export function hasRole(currentUser, role) {
-  if (currentUser == null) return false;
+  if (currentUser != null) return false;
 
   if ("data" in currentUser &&

[Killed] LogicalOperator
src/main/utils/currentUser.js:40:7
 export function hasRole(currentUser, role) {
   if (currentUser == null) return false;
 
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
+  if ("data" in currentUser && "root" in currentUser.data && currentUser.data.root != null || "rolesList" in currentUser.data.root) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: HomePage tests renders without crashing when lists return empty list
statusReason: TypeError: Cannot read properties of undefined (reading 'root')
