[Killed] BooleanLiteral
src/main/pages/PlayPage.js:21:52
 export default function PlayPage() {
     const { commonsId } = useParams();
     const { data: currentUser } = useCurrentUser();
-    const [isModalOpen, setIsModalOpen] = useState(false);
+    const [isModalOpen, setIsModalOpen] = useState(true);
     const [message, setMessage] = useState();
     const [numCows, setNumCows] = useState(1);
killedBy: PlayPage tests Buy and Sell Cows Modal is Closed by Default
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/main/pages/PlayPage.js:25:29
     const [message, setMessage] = useState();
     const [numCows, setNumCows] = useState(1);
 
-    const openModal = () => {
-        setIsModalOpen(true);
-    };
+    const openModal = () => {};
 
     const closeModal = () => {
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:26:24
     const [numCows, setNumCows] = useState(1);
 
     const openModal = () => {
-        setIsModalOpen(true);
+        setIsModalOpen(false);
     };
 
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] BlockStatement
src/main/pages/PlayPage.js:29:30
         setIsModalOpen(true);
     };
 
-    const closeModal = () => {
-        setIsModalOpen(false);
-    };
+    const closeModal = () => {};
 
     // Stryker disable all
killedBy: PlayPage tests click sell button
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:30:24
     };
 
     const closeModal = () => {
-        setIsModalOpen(false);
+        setIsModalOpen(true);
     };
 
killedBy: PlayPage tests click sell button
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BlockStatement
src/main/pages/PlayPage.js:94:45
     );
     // Stryker restore all
 
-    const onBuy = (userCommons, numCows) => {
-        mutationbuy.mutate(userCommons, numCows);
-    };
+    const onBuy = (userCommons, numCows) => {};
 
     const onSuccessSell = () => {};
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] BlockStatement
src/main/pages/PlayPage.js:120:46
     );
     // Stryker restore all
 
-    const onSell = (userCommons, numCows) => {
-        mutationsell.mutate(userCommons, numCows);
-    };
+    const onSell = (userCommons, numCows) => {};
 
     const [isChatOpen, setIsChatOpen] = useState(false);
killedBy: PlayPage tests click sell button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:124:50
         mutationsell.mutate(userCommons, numCows);
     };
 
-    const [isChatOpen, setIsChatOpen] = useState(false);
+    const [isChatOpen, setIsChatOpen] = useState(true);
 
     const toggleChatWindow = () => {
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BlockStatement
src/main/pages/PlayPage.js:126:36
 
     const [isChatOpen, setIsChatOpen] = useState(false);
 
-    const toggleChatWindow = () => {
-        setIsChatOpen((prevState) => !prevState);
-    };
+    const toggleChatWindow = () => {};
 
     const chatButtonStyle = {
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ArrowFunction
src/main/pages/PlayPage.js:127:23
     const [isChatOpen, setIsChatOpen] = useState(false);
 
     const toggleChatWindow = () => {
-        setIsChatOpen((prevState) => !prevState);
+        setIsChatOpen(() => undefined);
     };
 
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:127:38
     const [isChatOpen, setIsChatOpen] = useState(false);
 
     const toggleChatWindow = () => {
-        setIsChatOpen((prevState) => !prevState);
+        setIsChatOpen((prevState) => prevState);
     };
 
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] StringLiteral
src/main/pages/PlayPage.js:131:16
     };
 
     const chatButtonStyle = {
-        width: "60px",
+        width: "",
         height: "60px",
         borderRadius: "25%",
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 25%;
  bottom: 30px;
  color: black;

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:141:32
         right: "30px",
     };
 
-    const chatContainerStyle = {
-        width: "550px",
-        position: "fixed",
-        bottom: "100px",
-        right: "20px",
-    };
+    const chatContainerStyle = {};
 
     const emojiStyle = {
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- bottom: 100px;
- position: fixed;
- right: 20px;
- width: 550px;

[Killed] StringLiteral
src/main/pages/PlayPage.js:142:16
     };
 
     const chatContainerStyle = {
-        width: "550px",
+        width: "",
         position: "fixed",
         bottom: "100px",
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  bottom: 100px;
  position: fixed;
  right: 20px;
- width: 550px;

[Killed] StringLiteral
src/main/pages/PlayPage.js:149:21
     };
 
     const emojiStyle = {
-        fontFamily: "Arial, sans-serif",
+        fontFamily: "",
         fontSize: "30px",
     };
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- font-family: Arial, sans-serif;

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:153:27
         fontSize: "30px",
     };
     
-    const commonsLoaded = !(typeof commonsPlus == 'undefined')
+    const commonsLoaded = typeof commonsPlus == 'undefined'
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:153:29
         fontSize: "30px",
     };
     
-    const commonsLoaded = !(typeof commonsPlus == 'undefined')
+    const commonsLoaded = !(true)
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:154:91
     };
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined')
-    const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
+    const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => true));
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
 
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="card" data-testid="commons-card" style="opacity: 0.9;"><h1 class="animate-charcter"> Hello there, skilled farmer Nom!</h1></div> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:154:91
     };
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined')
-    const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
+    const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => false));
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] EqualityOperator
src/main/pages/PlayPage.js:155:95
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined')
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
-    const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
+    const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id !== commonsPlus.commons.id));
 
     return (
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: TestingLibraryElementError: Unable to find an element with the text: Whoa there, parder! You ain't a part of this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:155:51
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined')
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
-    const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
+    const userNotJoinedCommons = commonsLoaded && currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id);
 
     return (
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: TestingLibraryElementError: Unable to find an element with the text: Whoa there, parder! You ain't a part of this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:159:20
 
     return (
         <div
-            style={{
-                backgroundSize: "cover",
-                backgroundImage: `url(${Background})`,
-            }}
+            style={{}}
             data-testid="playpage-div"
         >
killedBy: PlayPage tests Make sure div has correct attributes
statusReason: Error: expect(element).toHaveAttribute("style", StringContaining "background-size: cover; background-image: url(PlayPageBackground.jpg);") // element.getAttribute("style") === StringContaining "background-size: cover; background-image: url(PlayPageBackground.jpg);"

Expected the element to have attribute:
  style=StringContaining "background-size: cover; background-image: url(PlayPageBackground.jp

[Killed] StringLiteral
src/main/pages/PlayPage.js:161:34
         <div
             style={{
                 backgroundSize: "cover",
-                backgroundImage: `url(${Background})`,
+                backgroundImage: ``,
             }}
             data-testid="playpage-div"
killedBy: PlayPage tests Make sure div has correct attributes
statusReason: Error: expect(element).toHaveAttribute("style", StringContaining "background-size: cover; background-image: url(PlayPageBackground.jpg);") // element.getAttribute("style") === StringContaining "background-size: cover; background-image: url(PlayPageBackground.jpg);"

Expected the element to have attribute:
  style=StringContaining "background-size: cover; background-image: url(PlayPageBackground.jp

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:167:22
         >
             <BasicLayout>
                 <Container>
-                    {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {false}
                     {userNotJoinedCommons &&  <h1>Whoa there, parder! You ain't a part of this commons!</h1> }             
                     {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:167:22
         >
             <BasicLayout>
                 <Container>
-                    {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {userJoinedCommons || !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons &&  <h1>Whoa there, parder! You ain't a part of this commons!</h1> }             
                     {!!commonsPlus && (
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="card" data-testid="commons-card" style="opacity: 0.9;"><h1 class="animate-charcter"> Welcome to another chapter in your tale, farmer Nom!</h1></div> instead

[Killed] LogicalOperator
src/main/pages/PlayPage.js:168:22
             <BasicLayout>
                 <Container>
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {userNotJoinedCommons &&  <h1>Whoa there, parder! You ain't a part of this commons!</h1> }             
+                    {userNotJoinedCommons || <h1>Whoa there, parder! You ain't a part of this commons!</h1> }             
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: TestingLibraryElementError: Unable to find an element with the text: Whoa there, parder! You ain't a part of this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:168:22
             <BasicLayout>
                 <Container>
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {userNotJoinedCommons &&  <h1>Whoa there, parder! You ain't a part of this commons!</h1> }             
+                    {true }             
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: Error: Unable to find an element with the text: Whoa there, parder! You ain't a part of this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:169:23
                 <Container>
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons &&  <h1>Whoa there, parder! You ain't a part of this commons!</h1> }             
-                    {!!commonsPlus && (
+                    {!commonsPlus && (
                         <CommonsOverview
                             commonsPlus={commonsPlus}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:169:22
                 <Container>
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons &&  <h1>Whoa there, parder! You ain't a part of this commons!</h1> }             
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:176:22
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
+                    {!userCommons && !!commonsPlus && (
                         <CardGroup>
                             <ManageCows
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:176:22
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
-                        <CardGroup>
-                            <ManageCows
-                                userCommons={userCommons}
-                                commons={commonsPlus.commons}
-                                setMessage={setMessage}
-                                openModal={openModal}
-                            />
-                            <FarmStats userCommons={userCommons} />
-                            <Profits
-                                userCommons={userCommons}
-                                profits={userCommonsProfits}
-                            />
-                            <ManageCowsModal
-                                number={numCows}
-                                setNumber={setNumCows}
-                                userCommons={userCommons}
-                                isOpen={isModalOpen}
-                                message={message}
-                                onClose={closeModal}
-                                onBuy={onBuy}
-                                onSell={onSell}
-                            />
-                        </CardGroup>
-                    )}
+                    {false}
                 </Container>
             </BasicLayout>
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] LogicalOperator
src/main/pages/PlayPage.js:203:16
                     )}
                 </Container>
             </BasicLayout>
-            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
+            { (hasRole(currentUser, "ROLE_ADMIN") && !!commonsPlus && commonsPlus.commons.showChat) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
                     {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="playpage-chat-toggle"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:203:55
                     )}
                 </Container>
             </BasicLayout>
-            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
+            { (hasRole(currentUser, "ROLE_ADMIN") || (!commonsPlus && commonsPlus.commons.showChat)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
                     {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] LogicalOperator
src/main/pages/PlayPage.js:205:22
             </BasicLayout>
             { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+                    {!!isChatOpen || <ChatPanel commonsId={commonsId} />}
                     <Button
                         style={chatButtonStyle}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:205:22
             </BasicLayout>
             { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+                    {false}
                     <Button
                         style={chatButtonStyle}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:211:26
                         onClick={toggleChatWindow}
                         data-testid="playpage-chat-toggle"
                     >
-                        {!!isChatOpen ? (
+                        {!isChatOpen ? (
                             <span style={emojiStyle} data-testid="close-icon">
                                 ❌
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  💬
Received:
  ❌
