[Killed] BlockStatement
src/main/utils/useBackend.js:52:81
         });
 }
 
-export function useBackendNoToast(queryKey, axiosParameters, initialData, rest) {
-//sends error messages to console.log rather than toast pop up
-    return useQuery({
-        queryKey: queryKey,
-        queryFn: async () => {
-            try {
-                const response = await axios(axiosParameters);
-                return response.data;
-            } catch (e) {
-                // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
-                    console.log(e.response.data.message);
-                } else {
-                    const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                    toast.error(errorMessage);
-                }
-                throw e;
-            }
-        }, 
-        initialData: initialData,
-        ...rest
-        });
-}
+export function useBackendNoToast(queryKey, axiosParameters, initialData, rest) {}
 
 const wrappedParams = async (params) => {
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackendNoToast handles 404 error correctly
statusReason: Error: Timed out in waitFor after 1000ms.

[Timeout] BlockStatement
src/main/utils/useBackend.js:56:30
 //sends error messages to console.log rather than toast pop up
     return useQuery({
         queryKey: queryKey,
-        queryFn: async () => {
-            try {
-                const response = await axios(axiosParameters);
-                return response.data;
-            } catch (e) {
-                // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
-                    console.log(e.response.data.message);
-                } else {
-                    const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                    toast.error(errorMessage);
-                }
-                throw e;
-            }
-        }, 
+        queryFn: async () => {}, 
         initialData: initialData,
         ...rest

[Timeout] BlockStatement
src/main/utils/useBackend.js:60:25
             try {
                 const response = await axios(axiosParameters);
                 return response.data;
-            } catch (e) {
-                // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
-                    console.log(e.response.data.message);
-                } else {
-                    const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                    toast.error(errorMessage);
-                }
-                throw e;
-            }
+            } catch (e) {}
         }, 
         initialData: initialData,

[Killed] BlockStatement
src/main/utils/useBackend.js:62:48
                 return response.data;
             } catch (e) {
                 // Stryker disable next-line OptionalChaining
-                if (e.response?.data?.message) {
-                    console.log(e.response.data.message);
-                } else {
+                if (e.response?.data?.message) {} else {
                     const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
                     toast.error(errorMessage);
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackendNoToast handles 404 error correctly
statusReason: Error: Timed out in waitFor after 1000ms.

[Killed] BlockStatement
src/main/utils/useBackend.js:64:24
                 // Stryker disable next-line OptionalChaining
                 if (e.response?.data?.message) {
                     console.log(e.response.data.message);
-                } else {
-                    const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-                    toast.error(errorMessage);
-                }
+                } else {}
                 throw e;
             }
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackendNoToast handles 404 error with no message
statusReason: Error: Timed out in waitFor after 1000ms.

[Timeout] BlockStatement
src/main/utils/useBackend.js:80:93
     return await (await axios(params)).data;
 };
 
-export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {
-    const queryClient = useQueryClient();
-
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (error) => {
-            // Stryker disable next-line OptionalChaining : we want to check if each nested object is there but we dont want to write tests for each specific case
-            if (error.response?.data?.message) {
-                toast.error(error.response.data.message);
-            } else {
-                const errorMessage = `Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-                toast.error(errorMessage);
-            }
-        },
-        // Stryker disable all : Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            if (queryKey !== null)
-                queryClient.invalidateQueries(queryKey);
-        },
-        // Stryker restore all
-        retry: false,
-        ...useMutationParams
-    })
-}
+export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {}
 
 
