[Killed] ConditionalExpression
src/main/pages/PlayPage.js:185:22
                 <Container>
                     {startDelay()}
                     {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
-                    {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {true && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
                     {!!commonsPlus && (
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="card" data-testid="commons-card" style="opacity: 0.9;"><h1 class="animate-charcter"> Top of the morning to you farmer Nom!</h1></div> instead
