[Killed] BooleanLiteral
src/main/pages/PlayPage.js:24:58
     const [isModalOpen, setIsModalOpen] = useState(false);
     const [message, setMessage] = useState();
     const [numCows, setNumCows] = useState(1);
-    const [showAfterDelay, setShowAfterDelay] = useState(false);
+    const [showAfterDelay, setShowAfterDelay] = useState(true);
     
     const startDelay = () => {
killedBy: PlayPage tests user has entered joined and extant commons (one commons created)
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1> instead

[Killed] BlockStatement
src/main/pages/PlayPage.js:26:30
     const [numCows, setNumCows] = useState(1);
     const [showAfterDelay, setShowAfterDelay] = useState(false);
     
-    const startDelay = () => {
-        setTimeout(() => {
-            setShowAfterDelay(true);
-        }, 100);
-    };
+    const startDelay = () => {};
 
     const openModal = () => {
killedBy: PlayPage tests user has entered nonexistent the commons (one commons created)
statusReason: 
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BlockStatement
src/main/pages/PlayPage.js:27:26
     const [showAfterDelay, setShowAfterDelay] = useState(false);
     
     const startDelay = () => {
-        setTimeout(() => {
-            setShowAfterDelay(true);
-        }, 100);
+        setTimeout(() => {}, 100);
     };
 
killedBy: PlayPage tests user has entered nonexistent the commons (one commons created)
statusReason: 
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:28:31
     
     const startDelay = () => {
         setTimeout(() => {
-            setShowAfterDelay(true);
+            setShowAfterDelay(false);
         }, 100);
     };
killedBy: PlayPage tests user has entered nonexistent the commons (one commons created)
statusReason: 
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:168:27
         fontSize: "30px",
     };
     
-    const commonsLoaded = !(typeof commonsPlus == 'undefined');
+    const commonsLoaded = typeof commonsPlus == 'undefined';
     const commonsExists = commons.some(com => parseInt(com.id) === parseInt(commonsId));
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:168:29
         fontSize: "30px",
     };
     
-    const commonsLoaded = !(typeof commonsPlus == 'undefined');
+    const commonsLoaded = !(true);
     const commonsExists = commons.some(com => parseInt(com.id) === parseInt(commonsId));
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:169:47
     };
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined');
-    const commonsExists = commons.some(com => parseInt(com.id) === parseInt(commonsId));
+    const commonsExists = commons.some(com => true);
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
killedBy: PlayPage tests user has entered nonexistent the commons (one commons created)
statusReason: 
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ArrowFunction
src/main/pages/PlayPage.js:169:40
     };
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined');
-    const commonsExists = commons.some(com => parseInt(com.id) === parseInt(commonsId));
+    const commonsExists = commons.some(() => undefined);
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
killedBy: PlayPage tests Shows chat button for admins if showChat is false
statusReason: Error: Unable to find an element by: [data-testid="playpage-chat-toggle"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:170:31
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined');
     const commonsExists = commons.some(com => parseInt(com.id) === parseInt(commonsId));
-    const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
+    const userJoinedCommons = true;
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
 
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="card" data-testid="commons-card" style="opacity: 0.9;"><h1 class="animate-charcter"> Your land awaits farmer Nom!</h1></div> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:170:91
     
     const commonsLoaded = !(typeof commonsPlus == 'undefined');
     const commonsExists = commons.some(com => parseInt(com.id) === parseInt(commonsId));
-    const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
+    const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => false));
     const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:171:34
     const commonsLoaded = !(typeof commonsPlus == 'undefined');
     const commonsExists = commons.some(com => parseInt(com.id) === parseInt(commonsId));
     const userJoinedCommons = commonsLoaded && (currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
-    const userNotJoinedCommons = commonsLoaded && !(currentUser.root.user.commons.some(com => com.id === commonsPlus.commons.id));
+    const userNotJoinedCommons = false;
 
     return (
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: Error: Unable to find an element with the text: Whoa there, parder! You ain't a part of this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:184:22
             <BasicLayout>
                 <Container>
                     {startDelay()}
-                    {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
+                    {false}
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
killedBy: PlayPage tests user has entered nonexistent the commons (one commons created)
statusReason: 
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:184:22
             <BasicLayout>
                 <Container>
                     {startDelay()}
-                    {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
+                    {true}
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
killedBy: PlayPage tests user has entered nonexistent the commons (one commons created)
statusReason: 
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:185:43
                 <Container>
                     {startDelay()}
                     {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
-                    {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {userJoinedCommons && !currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
                     {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:185:22
                 <Container>
                     {startDelay()}
                     {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
-                    {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {true}
                     {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
                     {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:186:22
                     {startDelay()}
                     {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
+                    {false }            
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests user has not joined the commons (single commons joined)
statusReason: Error: Unable to find an element with the text: Whoa there, parder! You ain't a part of this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:186:22
                     {startDelay()}
                     {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
+                    {userNotJoinedCommons || commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests user has joined the commons (single commons joined)
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Whoa there, parder! You ain't a part of this commons!</h1> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:187:22
                     {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:187:22
                     {!commonsExists && showAfterDelay &&  <h1>What are you doing here, friendo? This here commons don't exist! You best be headin' back.</h1>}
                     {userJoinedCommons && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {userNotJoinedCommons && commonsExists && <h1>Whoa there, parder! You ain't a part of this commons!</h1> }            
-                    {!!commonsPlus && (
+                    {!commonsPlus && (
                         <CommonsOverview
                             commonsPlus={commonsPlus}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:194:22
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
-                        <CardGroup>
-                            <ManageCows
-                                userCommons={userCommons}
-                                commons={commonsPlus.commons}
-                                setMessage={setMessage}
-                                openModal={openModal}
-                            />
-                            <FarmStats userCommons={userCommons} />
-                            <Profits
-                                userCommons={userCommons}
-                                profits={userCommonsProfits}
-                            />
-                            <ManageCowsModal
-                                number={numCows}
-                                setNumber={setNumCows}
-                                userCommons={userCommons}
-                                isOpen={isModalOpen}
-                                message={message}
-                                onClose={closeModal}
-                                onBuy={onBuy}
-                                onSell={onSell}
-                            />
-                        </CardGroup>
-                    )}
+                    {true}
                 </Container>
             </BasicLayout>
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] LogicalOperator
src/main/pages/PlayPage.js:221:74
                     )}
                 </Container>
             </BasicLayout>
-            { ((hasRole(currentUser, "ROLE_ADMIN") && commonsExists) || (!!commonsPlus && commonsPlus.commons.showChat && userJoinedCommons)) &&
+            { ((hasRole(currentUser, "ROLE_ADMIN") && commonsExists) || (!!commonsPlus && commonsPlus.commons.showChat || userJoinedCommons)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
                     {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests Doesn't show chat button for non-admins if showChat is false
statusReason: Error: expect(element).not.toBeInTheDocument()


<html>
  <head />
  <body
    class=""

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:221:15
                     )}
                 </Container>
             </BasicLayout>
-            { ((hasRole(currentUser, "ROLE_ADMIN") && commonsExists) || (!!commonsPlus && commonsPlus.commons.showChat && userJoinedCommons)) &&
-                <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-                    <Button
-                        style={chatButtonStyle}
-                        onClick={toggleChatWindow}
-                        data-testid="playpage-chat-toggle"
-                    >
-                        {!!isChatOpen ? (
-                            <span style={emojiStyle} data-testid="close-icon">
-                                ❌
-                            </span>
-                        ) : (
-                            <span style={emojiStyle} data-testid="message-icon">
-                                💬
-                            </span>
-                        )}
-                    </Button>
-                </div>
+            { false
             }
         </div>
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="playpage-chat-toggle"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div
